Repository: wp-plugins/simple-login-sc
Catalog: languages/slsc-*.po
Languages: fr_fr

source: Welcome
fr_fr: Bonjour

source: Simple Login SC does just what it means
fr_fr: Simple Login SC fait simplement ce que ça dit

source: Simple Login SC does not mess with other plugins because it does just login or logout a user. Nothing more. Nothing less.<br />It uses the core functions of WordPress thus not slowing down your site. No fancy stuff or hard settings. This is just a login plugin!
fr_fr: Simple Login SC n'interfère pas avec d'autres extensions puisqu'il fait seulement ouvrir ou fermer une session à un utilisateur. Rien de plus. Rien de moins.<br />Il utilise les fonctions de WordPress donc ne ralenti pas votre site. Pas de fioritures ou de paramètres compliqués. Ceci n'est qu'une extension de connexion!

source: Using Simple Login SC is absolutely easy
fr_fr: Utiliser Simple Login SC est d'une absolue facilité

source: Just type the shortcode where you want a login form to show.
fr_fr: Simplement insérer le <i>shortcode</i> où vous souhaitez qu'apparaisse un formulaire de connexion.

source: Use [sl_shortcode] shortcode to add a login form to a page, post or in a text/html widget.
fr_fr: Utilisez le <i>shortcode</i> [sl_shortcode] pour ajouter un formulaire de connexion dans une page, un article ou un widget texte/html.

source: You can optionally set the labels for "username", "password", the submit button and/or the welcome message, the logout text. Just by adding text to the shortcode.<br />
fr_fr: Vous pouvez optionnellement modifier les étiquettes pour "identifiant", "mot de passe", le bouton de soumission et/ou le message de bienvenu, le texte de déconnexion. Seulement en ajoutant du texte au <i>shortcode</i>.<br />

source: Usage
fr_fr: Utilisation

source: Example: [sl_shortcode username_label="What is your name?" password_label="Password Please!" button_text="Let me in!" welcome_text="Hello" logouttext="Let's go outside!"]
fr_fr: Exemple: [sl_shortcode username_label="Votre code utilisateur" password_label="Mot de passe SVP!" button_text="Laissez-moi entrer!" welcome_text="Allo" logouttext="Allons jouer dehors!"]

source: This is very useful if the language pack is not available in your language or if you have a multilangual site running WPML.
fr_fr: Ceci est très utile si le packetage dans votre langue n'est pas disponible ou si vous avez un site multilingue utilisant WPML.

source: If you do not set one or all of the optional text, the default text of WordPress and the plugin will be used.
fr_fr: Si vous n'entrez pas de paramètres optionnels, les textes par défaut de WordPress et de l'extension seront utilisés.

source: Need more?
fr_fr: Besoin de plus?

source: Has said before, Simple Login SC is just a login plugin. But if you need to redirect users on login, we suggest you use <a href="https://wordpress.org/plugins/peters-login-redirect/" target="_blank">Peter's Login Redirect</a> which has redirection base on user, roles...<br />And Simple Login SC does not conflict with Peter's Login Redirect. Great simple plugins that work together!
fr_fr: Comme cité plus haut, Simple Login SC est simplement une extension de connexion. Mais si vous avez besoin de rediriger vos utilisateur sur connexion, nous vous suggérons d'utiliser <a href="https://wordpress.org/plugins/peters-login-redirect/" target="_blank">Peter's Login Redirect</a> qui redirige selon l'utilisateur, le rôle...<br />Et Simple Login SC n'entre pas en conflit avec Peter's Login Redirect. De grandes et simples extensions qui travaillent ensemble!

source: Styling
fr_fr: Styliser

source: If your theme does not style the login CSS class of WordPress or does not have a Custom CSS option, you can use a plugin like <a href="https://wordpress.org/plugins/simple-custom-css/" target="_blank">Simple Custom CSS</a>.
fr_fr: Si votre thème ne stylise pas les classes CSS de connexion de WordPress ou n'a pas d'option de CSS personnalisés, vous pouvez utiliser une extension comme <a href="https://wordpress.org/plugins/simple-custom-css/" target="_blank">Simple Custom CSS</a>.

source: The CSS class you can customize are:
fr_fr: Les classes CSS que vous pouvez personnaliser sont;

source: Have a login fun!
fr_fr: Connectez vous avec bonheur!
